In [455]:
import pandas as pd

In [456]:

df = pd.DataFrame({
    "Name":[
        'Ghanshyam',
        'Manisha',
        'Shaunak',
        'Aadarsh',
        'Kaushal',
        'Santosh',
        'elina'
    ],
    "Age":[28, 26, 7, 27, 25, 35, 30],
    "Gender":['Male', 'Female', 'Male','male', 'male', 'Male', 'female']
},  index=([10, 20, 30, 7, 3, 4, 5]))

df.head()

         Name  Age  Gender
10  Ghanshyam   28    Male
20    Manisha   26  Female
30    Shaunak    7    Male
7     Aadarsh   27    male
3     Kaushal   25    male

In [457]:
age = pd.Series([28, 38, 48], name = "Age")
age

0    28
1    38
2    48
Name: Age, dtype: int64

In [458]:
df['Age']

10    28
20    26
30     7
7     27
3     25
4     35
5     30
Name: Age, dtype: int64

In [459]:
df['Age']

10    28
20    26
30     7
7     27
3     25
4     35
5     30
Name: Age, dtype: int64

In [460]:
# droplist = {'Age'}
# df.drop(droplist, axis=1, inplace = True)

In [461]:
# df.drop({"Name", 'Age'}, inplace=True, axis =1)

In [462]:
df

         Name  Age  Gender
10  Ghanshyam   28    Male
20    Manisha   26  Female
30    Shaunak    7    Male
7     Aadarsh   27    male
3     Kaushal   25    male
4     Santosh   35    Male
5       elina   30  female

In [463]:
df_titanic = pd.read_csv('https://raw.githubusercontent.com/pandas-dev/pandas/main/doc/data/titanic.csv')
df_titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [464]:
df_titanic.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [465]:
df_titanic.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [466]:
df_titanic.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [467]:
df_mean = df_titanic['Age'].mean()
df_titanic['Age']

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [468]:
df_titanic["Age"]= df_titanic['Age'].fillna(df_titanic['Age'].mean(),  axis=0)
# df_titanic['Age'] = df_titanic['Age'].fillna(df_titanic['Age'].mean(), axis=0,)

In [469]:
df_titanic['Age'].isna()

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888    False
889    False
890    False
Name: Age, Length: 891, dtype: bool

In [470]:
df_titanic.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [471]:
df_titanic['Embarked'] = df_titanic['Embarked'].fillna(df_titanic['Embarked'].mode())

In [472]:
df_titanic.isna().count()

PassengerId    891
Survived       891
Pclass         891
Name           891
Sex            891
Age            891
SibSp          891
Parch          891
Ticket         891
Fare           891
Cabin          891
Embarked       891
dtype: int64

In [473]:
df_titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.000000,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.000000,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.000000,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.000000,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.000000,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.000000,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.000000,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,29.699118,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.000000,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.000000,0,0,370376,7.7500,NaN,Q

In [474]:
df

         Name  Age  Gender
10  Ghanshyam   28    Male
20    Manisha   26  Female
30    Shaunak    7    Male
7     Aadarsh   27    male
3     Kaushal   25    male
4     Santosh   35    Male
5       elina   30  female

In [475]:
df.to_numpy

<bound method DataFrame.to_numpy of          Name  Age  Gender
10  Ghanshyam   28    Male
20    Manisha   26  Female
30    Shaunak    7    Male
7     Aadarsh   27    male
3     Kaushal   25    male
4     Santosh   35    Male
5       elina   30  female>

In [476]:
df.index

Int64Index([10, 20, 30, 7, 3, 4, 5], dtype='int64')

In [477]:
df

         Name  Age  Gender
10  Ghanshyam   28    Male
20    Manisha   26  Female
30    Shaunak    7    Male
7     Aadarsh   27    male
3     Kaushal   25    male
4     Santosh   35    Male
5       elina   30  female

In [478]:
df.T.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, Name to Gender
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   10      3 non-null      object
 1   20      3 non-null      object
 2   30      3 non-null      object
 3   7       3 non-null      object
 4   3       3 non-null      object
 5   4       3 non-null      object
 6   5       3 non-null      object
dtypes: object(7)
memory usage: 300.0+ bytes

In [479]:
df.info(verbose = True)

<class 'pandas.core.frame.DataFrame'>
Int64Index: 7 entries, 10 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Age     7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 524.0+ bytes

### pandas dataframe - select_dtypes

In [480]:
df_titanic.select_dtypes\
    (include = 'int').isna().sum()

PassengerId    0
Survived       0
Pclass         0
SibSp          0
Parch          0
dtype: int64

In [481]:
df_titanic.select_dtypes\
    (exclude = 'int').isna().sum()

Name          0
Sex           0
Age           0
Ticket        0
Fare          0
Cabin       687
Embarked      2
dtype: int64

In [482]:
df_titanic.select_dtypes\
    (exclude = {'int', 'float'})

,Name,Sex,Ticket,Cabin,Embarked
0,"Braund, Mr. Owen Harris",male,A/5 21171,NaN,S
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,PC 17599,C85,C
2,"Heikkinen, Miss. Laina",female,STON/O2. 3101282,NaN,S
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,113803,C123,S
4,"Allen, Mr. William Henry",male,373450,NaN,S
...,...,...,...,...,...
886,"Montvila, Rev. Juozas",male,211536,NaN,S
887,"Graham, Miss. Margaret Edith",female,112053,B42,S
888,"Johnston, Miss. Catherine Helen ""Carrie""",female,W./C. 6607,NaN,S
889,"Behr, Mr. Karl Howell",male,111369,C148,C
890,"Dooley, Mr. Patrick",male,370376,NaN,Q

In [483]:
df_titanic.select_dtypes\
    (include = {'float', 'object'})

,Name,Sex,Age,Ticket,Fare,Cabin,Embarked
0,"Braund, Mr. Owen Harris",male,22.000000,A/5 21171,7.2500,NaN,S
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.000000,PC 17599,71.2833,C85,C
2,"Heikkinen, Miss. Laina",female,26.000000,STON/O2. 3101282,7.9250,NaN,S
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.000000,113803,53.1000,C123,S
4,"Allen, Mr. William Henry",male,35.000000,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...
886,"Montvila, Rev. Juozas",male,27.000000,211536,13.0000,NaN,S
887,"Graham, Miss. Margaret Edith",female,19.000000,112053,30.0000,B42,S
888,"Johnston, Miss. Catherine Helen ""Carrie""",female,29.699118,W./C. 6607,23.4500,NaN,S
889,"Behr, Mr. Karl Howell",male,26.000000,111369,30.0000,C148,C
890,"Dooley, Mr. Patrick",male,32.000000,370376,7.7500,NaN,Q

In [484]:
df_titanic.select_dtypes\
    (include = 'float')

           Age     Fare
0    22.000000   7.2500
1    38.000000  71.2833
2    26.000000   7.9250
3    35.000000  53.1000
4    35.000000   8.0500
..         ...      ...
886  27.000000  13.0000
887  19.000000  30.0000
888  29.699118  23.4500
889  26.000000  30.0000
890  32.000000   7.7500

[891 rows x 2 columns]

In [485]:
df_titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [486]:
df.to_numpy()

array([['Ghanshyam', 28, 'Male'],
       ['Manisha', 26, 'Female'],
       ['Shaunak', 7, 'Male'],
       ['Aadarsh', 27, 'male'],
       ['Kaushal', 25, 'male'],
       ['Santosh', 35, 'Male'],
       ['elina', 30, 'female']], dtype=object)

In [487]:
import numpy as np
df['Time'] = np.random.random(len(df))

In [488]:
df.values

array([['Ghanshyam', 28, 'Male', 0.04785973516164854],
       ['Manisha', 26, 'Female', 0.06564614619295273],
       ['Shaunak', 7, 'Male', 0.14280413690649463],
       ['Aadarsh', 27, 'male', 0.8150557743091922],
       ['Kaushal', 25, 'male', 0.2232726388325712],
       ['Santosh', 35, 'Male', 0.8269953608535938],
       ['elina', 30, 'female', 0.7918320305473165]], dtype=object)

In [489]:
df.style

In [502]:
df.style.format_index(str.upper, axis = 1)

In [509]:
df.axes

[Int64Index([10, 20, 30, 7, 3, 4, 5], dtype='int64'),
 Index(['Name', 'Age', 'Gender', 'Time'], dtype='object')]

In [510]:
df.ndim

2

In [511]:
df.size

28

In [512]:
df.shape

(7, 4)

In [514]:
df.memory_usage(index= True)

Index     356
Name       56
Age        56
Gender     56
Time       56
dtype: int64

In [517]:
df_titanic.empty

False

ValueError: invalid literal for int() with base 10: 'Ghanshyam'